FlashCardApp/app/controllers/cards_controller.rb

SELECT  "cards".* FROM "cards" WHERE "cards"."deck_id" = ? AND "cards"."id" = ? LIMIT 1  [["deck_id", 1], ["id", 1]]
---
  def show
    @cards = @decks.cards.find(params[:id])

INSERT INTO "cards" ("frontContent", "backContent", "description", "deck_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["frontContent", "asd"], ["backContent", "adsa"], ["description", "asdas"], ["deck_id", 1], ["created_at", "2016-02-05 20:20:33.404498"], ["updated_at", "2016-02-05 20:20:33.404498"]]
---
  def create
    @cards = @decks.cards.build(card_params)

    respond_to do |format|
      if @cards.save

SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_deck
      @decks = Deck.find(params[:deck_id])