app/controllers/decks_controller.rb

  def create
    @deck = Deck.new(deck_params)

    respond_to do |format|
      if @deck.save
---
INSERT INTO "decks" ("title", "description", "category", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ksj"], ["description", "lkjs"], ["category", "lksjdf"], ["created_by", "lskdjf"], ["created_at", "2016-02-05 19:43:14.125033"], ["updated_at", "2016-02-05 19:43:14.125033"]]

  def destroy
    @deck.destroy
---
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 980190962]]

    def set_deck
      @deck = Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", 980190962]]